hanserf/efm32pg22_devkit/gecko_sdk_3_2_2/platform/emlib/inc/em_cmu.h
#if defined(HFXO_CTRL_EM23ONDEMAND)
/** Default HFXO initialization values for XTAL mode. */
#define CMU_HFXOINIT_DEFAULT                                        \
  {                                                                 \
    cmuHfxoCbLsbTimeout_416us,                                      \
    cmuHfxoSteadyStateTimeout_833us,  /* First lock              */ \
    cmuHfxoSteadyStateTimeout_83us,   /* Subsequent locks        */ \
    0U,                         /* ctuneXoStartup                */ \
    0U,                         /* ctuneXiStartup                */ \
    32U,                        /* coreBiasStartup               */ \
    32U,                        /* imCoreBiasStartup             */ \
    cmuHfxoCoreDegen_None,                                          \
    cmuHfxoCtuneFixCap_Both,                                        \
    _HFXO_XTALCTRL_CTUNEXOANA_DEFAULT, /* ctuneXoAna             */ \
    _HFXO_XTALCTRL_CTUNEXIANA_DEFAULT, /* ctuneXiAna             */ \
    60U,                        /* coreBiasAna                   */ \
    false,                      /* enXiDcBiasAna                 */ \
    cmuHfxoOscMode_Crystal,                                         \
    false,                      /* forceXo2GndAna                */ \
    false,                      /* forceXi2GndAna                */ \
    false,                      /* DisOndemand                   */ \
    false,                      /* ForceEn                       */ \
    false,                      /* em23OnDemand                  */ \
    false                       /* Lock registers                */ \
  }

/** Default HFXO initialization values for external sine mode. */
#define CMU_HFXOINIT_EXTERNAL_SINE                                               \
  {                                                                              \
    (CMU_HfxoCbLsbTimeout_TypeDef)0,       /* timeoutCbLsb                    */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, first lock       */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, subseq. locks    */ \
    0U,                         /* ctuneXoStartup                             */ \
    0U,                         /* ctuneXiStartup                             */ \
    0U,                         /* coreBiasStartup                            */ \
    0U,                         /* imCoreBiasStartup                          */ \
    cmuHfxoCoreDegen_None,                                                       \
    cmuHfxoCtuneFixCap_None,                                                     \
    0U,                         /* ctuneXoAna                                 */ \
    0U,                         /* ctuneXiAna                                 */ \
    0U,                         /* coreBiasAna                                */ \
    false, /* enXiDcBiasAna, false=DC true=AC coupling of signal              */ \
    cmuHfxoOscMode_ExternalSine,                                                 \
    false,                      /* forceXo2GndAna                             */ \
    false,                      /* forceXi2GndAna (Never enable in sine mode) */ \
    false,                      /* DisOndemand                                */ \
    false,                      /* ForceEn                                    */ \
    false,                      /* em23OnDemand                               */ \
    false                       /* Lock registers                             */ \
  }

/** Default HFXO initialization values for external sine mode with peak detector. */
#define CMU_HFXOINIT_EXTERNAL_SINEPKDET                                          \
  {                                                                              \
    (CMU_HfxoCbLsbTimeout_TypeDef)0,       /* timeoutCbLsb                    */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, first lock       */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, subseq. locks    */ \
    0U,                         /* ctuneXoStartup                             */ \
    0U,                         /* ctuneXiStartup                             */ \
    0U,                         /* coreBiasStartup                            */ \
    0U,                         /* imCoreBiasStartup                          */ \
    cmuHfxoCoreDegen_None,                                                       \
    cmuHfxoCtuneFixCap_None,                                                     \
    0U,                         /* ctuneXoAna                                 */ \
    0U,                         /* ctuneXiAna                                 */ \
    0U,                         /* coreBiasAna                                */ \
    false, /* enXiDcBiasAna, false=DC true=AC coupling of signal              */ \
    cmuHfxoOscMode_ExternalSinePkDet,                                            \
    false,                      /* forceXo2GndAna                             */ \
    false,                      /* forceXi2GndAna (Never enable in sine mode) */ \
    false,                      /* DisOndemand                                */ \
    false,                      /* ForceEn                                    */ \
    false,                      /* em23OnDemand                               */ \
    false                       /* Lock registers                             */ \
  }
#else
/** Default HFXO initialization values for XTAL mode. */
#define CMU_HFXOINIT_DEFAULT                                        \
  {                                                                 \
    cmuHfxoCbLsbTimeout_416us,                                      \
    cmuHfxoSteadyStateTimeout_833us,  /* First lock              */ \
    cmuHfxoSteadyStateTimeout_83us,   /* Subsequent locks        */ \
    0U,                         /* ctuneXoStartup                */ \
    0U,                         /* ctuneXiStartup                */ \
    32U,                        /* coreBiasStartup               */ \
    32U,                        /* imCoreBiasStartup             */ \
    cmuHfxoCoreDegen_None,                                          \
    cmuHfxoCtuneFixCap_Both,                                        \
    _HFXO_XTALCTRL_CTUNEXOANA_DEFAULT, /* ctuneXoAna             */ \
    _HFXO_XTALCTRL_CTUNEXIANA_DEFAULT, /* ctuneXiAna             */ \
    60U,                        /* coreBiasAna                   */ \
    false,                      /* enXiDcBiasAna                 */ \
    cmuHfxoOscMode_Crystal,                                         \
    false,                      /* forceXo2GndAna                */ \
    false,                      /* forceXi2GndAna                */ \
    false,                      /* DisOndemand                   */ \
    false,                      /* ForceEn                       */ \
    false                       /* Lock registers                */ \
  }

