hanserf/efm32pg22_devkit/gecko_sdk_3_2_2/platform/emlib/inc/em_cmu.h
/** Default HFXO initialization values for external sine mode. */
#define CMU_HFXOINIT_EXTERNAL_SINE                                               \
  {                                                                              \
    (CMU_HfxoCbLsbTimeout_TypeDef)0,       /* timeoutCbLsb                    */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, first lock       */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, subseq. locks    */ \
    0U,                         /* ctuneXoStartup                             */ \
    0U,                         /* ctuneXiStartup                             */ \
    0U,                         /* coreBiasStartup                            */ \
    0U,                         /* imCoreBiasStartup                          */ \
    cmuHfxoCoreDegen_None,                                                       \
    cmuHfxoCtuneFixCap_None,                                                     \
    0U,                         /* ctuneXoAna                                 */ \
    0U,                         /* ctuneXiAna                                 */ \
    0U,                         /* coreBiasAna                                */ \
    false, /* enXiDcBiasAna, false=DC true=AC coupling of signal              */ \
    cmuHfxoOscMode_ExternalSine,                                                 \
    false,                      /* forceXo2GndAna                             */ \
    false,                      /* forceXi2GndAna (Never enable in sine mode) */ \
    false,                      /* DisOndemand                                */ \
    false,                      /* ForceEn                                    */ \
    false                       /* Lock registers                             */ \
  }

/** Default HFXO initialization values for external sine mode with peak detector. */
#define CMU_HFXOINIT_EXTERNAL_SINEPKDET                                          \
  {                                                                              \
    (CMU_HfxoCbLsbTimeout_TypeDef)0,       /* timeoutCbLsb                    */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, first lock       */ \
    (CMU_HfxoSteadyStateTimeout_TypeDef)0, /* timeoutSteady, subseq. locks    */ \
    0U,                         /* ctuneXoStartup                             */ \
    0U,                         /* ctuneXiStartup                             */ \
    0U,                         /* coreBiasStartup                            */ \
    0U,                         /* imCoreBiasStartup                          */ \
    cmuHfxoCoreDegen_None,                                                       \
    cmuHfxoCtuneFixCap_None,                                                     \
    0U,                         /* ctuneXoAna                                 */ \
    0U,                         /* ctuneXiAna                                 */ \
    0U,                         /* coreBiasAna                                */ \
    false, /* enXiDcBiasAna, false=DC true=AC coupling of signal              */ \
    cmuHfxoOscMode_ExternalSinePkDet,                                            \
    false,                      /* forceXo2GndAna                             */ \
    false,                      /* forceXi2GndAna (Never enable in sine mode) */ \
    false,                      /* DisOndemand                                */ \
    false,                      /* ForceEn                                    */ \
    false                       /* Lock registers                             */ \
  }
#endif

#if defined(_HFXO_BUFOUTCTRL_MASK)
typedef enum {
  startupTimeout42Us  = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T42US,
  startupTimeout83Us  = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T83US,
  startupTimeout108Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T108US,
  startupTimeout133Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T133US,
  startupTimeout158Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T158US,
  startupTimeout183Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T183US,
  startupTimeout208Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T208US,
  startupTimeout233Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T233US,
  startupTimeout258Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T258US,
  startupTimeout283Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T283US,
  startupTimeout333Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T333US,
  startupTimeout375Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T375US,
  startupTimeout417Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T417US,
  startupTimeout458Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T458US,
  startupTimeout500Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T500US,
  startupTimeout667Us = _HFXO_BUFOUTCTRL_TIMEOUTSTARTUP_T667US,
} CMU_BufoutTimeoutStartup_TypeDef;

typedef struct {
  bool                                minimalStartupDelay;
  CMU_BufoutTimeoutStartup_TypeDef    timeoutStartup;
} CMU_BUFOUTLeaderInit_TypeDef;

#define CMU_HFXO_CRYSTAL_INIT_LEADER_DEFAULT        \
  {                                                 \
    true,                 /* minimalStartupDelay */ \
    startupTimeout208Us,  /* timeoutStartup      */ \
  }
#endif

#if defined(_HFXO_CTRL_PRSSTATUSSEL0_MASK)
typedef enum {
  PRS_Status_select_0,
  PRS_Status_select_1
} CMU_PRS_Status_Output_Select_TypeDef;

typedef struct {
  CMU_PRS_Status_Output_Select_TypeDef prsStatusSelectOutput;
  bool                                 em23OnDemand;
  bool                                 regLock;
} CMU_CrystalSharingFollowerInit_TypeDef;

#define CMU_HFXO_CRYSTAL_INIT_Follower_DEFAULT                                \
  {                                                                           \
    PRS_Status_select_0,                          /* prsStatusSelectOutput */ \
    true,                                         /* em23OnDemand          */ \
    false                                         /* regLock               */ \
  }
#endif

/** DPLL initialization structure. Frequency will be Fref*(N+1)/(M+1). */
typedef struct {
  uint32_t  frequency;                  /**< PLL frequency value, max 80 MHz. */
  uint16_t  n;                          /**< Factor N. 300 <= N <= 4095       */
  uint16_t  m;                          /**< Factor M. M <= 4095              */
  CMU_Select_TypeDef        refClk;     /**< Reference clock selector.        */
  CMU_DPLLEdgeSel_TypeDef   edgeSel;    /**< Reference clock edge detect selector. */
  CMU_DPLLLockMode_TypeDef  lockMode;   /**< DPLL lock mode selector.         */
  bool      autoRecover;                /**< Enable automatic lock recovery.  */
  bool      ditherEn;                   /**< Enable dither functionalityery.  */
} CMU_DPLLInit_TypeDef;

/**
 * DPLL initialization values for 39,998,805 Hz using LFXO as reference
 * clock, M=2 and N=3661.
 */
#define CMU_DPLL_LFXO_TO_40MHZ                                             \
  {                                                                        \
    39998805,                     /* Target frequency.                  */ \
    3661,                         /* Factor N.                          */ \
    2,                            /* Factor M.                          */ \
    cmuSelect_LFXO,               /* Select LFXO as reference clock.    */ \
    cmuDPLLEdgeSel_Fall,          /* Select falling edge of ref clock.  */ \
    cmuDPLLLockMode_Freq,         /* Use frequency lock mode.           */ \
    true,                         /* Enable automatic lock recovery.    */ \
    false                         /* Don't enable dither function.      */ \
  }

/**
 * DPLL initialization values for 76,800,000 Hz using HFXO as reference
 * clock, M = 1919, N = 3839
 */
#define CMU_DPLL_HFXO_TO_76_8MHZ                                           \
  {                                                                        \
    76800000,                     /* Target frequency.                  */ \
    3839,                         /* Factor N.                          */ \
    1919,                         /* Factor M.                          */ \
    cmuSelect_HFXO,               /* Select HFXO as reference clock.    */ \
    cmuDPLLEdgeSel_Fall,          /* Select falling edge of ref clock.  */ \
    cmuDPLLLockMode_Freq,         /* Use frequency lock mode.           */ \
    true,                         /* Enable automatic lock recovery.    */ \
    false                         /* Don't enable dither function.      */ \
  }

/**
 * DPLL initialization values for 80,000,000 Hz using HFXO as reference
 * clock, M = 1919, N = 3999.
 */
#define CMU_DPLL_HFXO_TO_80MHZ                                             \
  {                                                                        \
    80000000,                     /* Target frequency.                  */ \
    (4000 - 1),                   /* Factor N.                          */ \
    (1920 - 1),                   /* Factor M.                          */ \
    cmuSelect_HFXO,               /* Select HFXO as reference clock.    */ \
    cmuDPLLEdgeSel_Fall,          /* Select falling edge of ref clock.  */ \
    cmuDPLLLockMode_Freq,         /* Use frequency lock mode.           */ \
    true,                         /* Enable automatic lock recovery.    */ \
    false                         /* Don't enable dither function.      */ \
  }

/**
 * Default configurations for DPLL initialization. When using this macro
 * you need to modify the N and M factor and the desired frequency to match
 * the components placed on the board.
 */
#define CMU_DPLLINIT_DEFAULT                                               \
  {                                                                        \
    80000000,                     /* Target frequency.                  */ \
    (4000 - 1),                   /* Factor N.                          */ \
    (1920 - 1),                   /* Factor M.                          */ \
    cmuSelect_HFXO,               /* Select HFXO as reference clock.    */ \
    cmuDPLLEdgeSel_Fall,          /* Select falling edge of ref clock.  */ \
    cmuDPLLLockMode_Freq,         /* Use frequency lock mode.           */ \
    true,                         /* Enable automatic lock recovery.    */ \
    false                         /* Don't enable dither function.      */ \
  }

